## 28. Frequency(빈도)
### 시간(hour)이 13시 이전(13시 포함하지 않음) 데이터 중 가장 많은 결제가 이루어진 날짜(date)는? (date 컬럼과 동일한 양식으로 출력)
- 데이터: payment.csv

In [1]:
import pandas as pd

df = pd.read_csv('../data/payment.csv')
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [8]:
# 13시 이전 데이터
freq = df[df['hour'] < 13]['date'].value_counts()
print(freq)

20221203    2
20221130    1
20221202    1
20221225    1
Name: date, dtype: int64

In [9]:
print(freq.index[0])

20221203

<br><br>
## 29. 시계열 데이터(format)
### 12월인 데이터의 수는?
- 데이터: payment.csv

In [25]:
import pandas as pd

df = pd.read_csv('../data/payment.csv')
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [26]:
df['date'] = pd.to_datetime(df['date'], format='%Y%m%d')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    13 non-null     datetime64[ns]
 1   hour    13 non-null     int64
 2   menu    13 non-null     object
 3   price   13 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 544.0+ bytes

In [29]:
len(df[df['date'].dt.month == 12])

11

<br><br>
## 30. 시계열 데이터 (퍼센트)
### 12월 25일 결제 금액(price)은 12월 총 결제금액의 몇 %인가? (정수로 출력)
- 데이터: payment.csv

In [30]:
import pandas as pd

df = pd.read_csv('../data/payment.csv')
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [31]:
df['date'] = pd.to_datetime(df['date'], format='%Y%m%d')

In [32]:
# 12월 총 결제금액
total = df[df['date'].dt.month == 12]['price'].sum()
print(total)

34500

In [33]:
# 12월 25일 결제금액
money = df[(df['date'].dt.month == 12) & (df['date'].dt.day == 25)]['price'].sum()
print(money)

9000

In [35]:
print(money/total)
print(int((money/total)*100))

0.2608695652173913
26